var patterns = [
    // 1. 规范
    {
        name: '1.1 规范题目编号',
        pats: [{
            pat: /^ +(\d+)[、.·．]+ *?/,
            rep: /$1./
        }, {
            pat: /^ *(\d+)[、.·．]+ *?/,
            rep: /$1./
        }]
    }, {
        name: '1.2 规范选择题选项编号',
        pats: [{
            pre: [{
                pat: /([A-Z]) *[、.·．]+ *?/,
                rep: /$1./
            }],
            pat: /^ *([A-Z])[、.·．]+ *?/,
            rep: /$1./
        }]
    }, {
        name: '1.3 规范选择题答案',
        pats: [{
            pre: [
                // 1.3.1 替换字母间的空格
                //{ pat: /(?<=[A-Z])\s+(?=[A-Z])/, rep: '' },
                { pat: /([A-Z]{1})\s+(?=[A-Z])/, rep: '$1' },
                // 1.3.2 替换无字母的括号
                { pat: /[（(]\s*[)）]/, rep: ' ___ ' }
            ],
            pat: /[（(]\s*([A-Z]*)\s*[)）]/,
            rep: /\( $1 \)/
        }]
    }, {
        name: '1.4 规范判断题答案',
        pats: [{
            pat: /[（(]\s*([×√])\s*[)）]/,
            rep: /\( $1 \)/
        }]
    },
    /*----------------------------------------------------------------------*/
    // 2. 去除
    {
        name: '2.1 去除备注',
        pats: [{
            pat: /^ *[（(].*?$/,
            rep: ''
        }]
    }, {
        name: '2.2 去除分节',
        pats: [{
            pat: /^ *(第[一二三四五六七八九十]{1}节)\s*?/,
            rep: '// $1 '
        }]
    }, {
        name: '2.3 去除“解析”、“依据”、“解释”文本',
        pats: [{
            pat: /^ *(解析|依据|解释)[：:]?.*?$/,
            rep: ''
        }]
    }, {
        name: '2.4 去除多余换行',
        pats: [{
            pat: /(^\s$){1}/,
            rep: ''
        }]
    },
    /*----------------------------------------------------------------------*/

    // 3. 设置
    {
        name: '3.1 设置分类',
        pats: [{
            pat: /^ *第[一二三四五六七八九十]{1}章\s*?/,
            rep: '分类：'
        }]
    }, {
        name: '3.2 设置题型“单选题”',
        pats: [{
            pat: /^ *[一二三四五六七八九十]{1}(、|\.)(单项选择题|单选题){1}$/,
            rep: '题型：单选题'
        }]
    }, {
        name: '3.3 设置题型“多选题”',
        pats: [{
            pat: /^ *[一二三四五六七八九十]{1}(、|\.)(多项选择题|多选题){1}$/,
            rep: '题型：多选题'
        }]
    }, {
        name: '3.4 设置题型“判断题”',
        pats: [{
            pat: /^ *[一二三四五六七八九十]{1}(、|\.)(判断改错题|判断辨析题|判断题){1}.*?$/,
            rep: '题型：判断题'
        }]
    }, {
        name: '3.5 设置题型“实务题”',
        pats: [{
            pat: /^ *[一二三四五六七八九十]{1}(、|\.)(实务题){1}.*?$/,
            rep: '题型：实务题'
        }]
    }
]
