var patterns = [

    // 1. 规范
    {
        id: 1.1,
        type: 0,
        name: '1.1 规范题目编号',
        pats: [{
            //pat: /^ +(\d+)[、.·．]+ *?/,
            pat: /^\s*(\d+)[、.·．]+\s*/,
            rep: /$1./
        }/*, {
            pat: /^ *(\d+)[、.·．]+ *?/,
            rep: /$1./
        }*/]
    }, {
        id: 1.2,
        type: 1,
        name: '1.2 规范选择题选项编号',
        pats: [{
            /*pre: [{
                //pat: /([A-Z])\s*[、.·．]+ *?/,
                pat: /([A-Z])\s*[、.·．]\s*?/,
                rep: /$1./
            }],
            //pat: /^ *([A-Z])[、.·．]+ *?/,*/
            pat: /^\s*([A-Z])\s*[、.·．]\s*/,
            rep: /$1./
        }]
    }, {
        id: 1.3,
        type: 1,
        name: '1.3 规范选择题答案',
        pats: [{
            pre: [
                // 1.3.1 替换字母间的空格
                //{ pat: /(?<=[A-Z])\s+(?=[A-Z])/, rep: '' },  // javascript 不支持后向引用
                { pat: /([A-Z]{1})\s+(?=[A-Z])/, rep: '$1' },
                // 1.3.2 替换无字母的括号
                { pat: /[（(]\s*[)）]/, rep: ' ___ ' }
            ],
            pat: /[（(]\s*([A-Z]*)\s*[)）]/,
            rep: /\( $1 \)/
        }, {
            name: '1.3.4 去除金额数字间的空格',
            pat: /([A-Z]{1}\.)(\d+)\s+(\d+)/,
            rep: /$1$2$3/
        }]
    }, {
        id: 1.4,
        type: 1,
        name: '1.4 规范判断题答案',
        pats: [{
            pat: /[（(]\s*([×√])\s*[)）]/,
            rep: /\( $1 \)/
        }]
    }, {
        id: 1.5,
        type: 2,
        name: '1.5 规范答案标志',
        pats: [{
            pat: /^(解析[:：]|(参考答案[:：])|【(参考)?答案】)/,
            rep: '答案：'
        }]
    },
    /*----------------------------------------------------------------------------------------------------*/

    // 2. 去除
    {
        id: 2.1,
        type: 1,
        name: '2.1 去除备注',
        pats: [{
            pat: /^ *[（(].*?$/,
            rep: ''
        }]
    }, {
        id: 2.2,
        type: 0,
        name: '2.2 去除分节',
        pats: [{
            pat: /^ *(第[一二三四五六七八九十]{1}节)\s*?/,
            rep: '// $1 '
        }]
    }, {
        id: 2.3,
        type: 1,
        name: '2.3 去除“解析”、“依据”、“解释”文本',
        pats: [{
            pat: /^ *(解析|依据|解释)[：:]?.*?$/,
            rep: ''
        }]
    }, {
        id: 2.4,
        type: 1,
        name: '2.4 去除多余换行',
        pats: [{
            pat: /(^\s$){1}/,
            rep: ''
        }]
    },
    /*----------------------------------------------------------------------------------------------------*/

    // 3. 设置
    {
        id: 3.1,
        type: 0,
        name: '3.1 设置分类',
        pats: [{
            pat: /(^)? *第[一二三四五六七八九十]{1}章\s*/,
            rep: '分类：'
        }]
    }, {
        id: 3.2,
        type: 1,
        name: '3.2 设置题型“单选题”',
        pats: [{
            pat: /^ *[一二三四五六七八九十]{1}(、|\.)(单项选择题|单选题){1}$/,
            rep: '题型：单选题'
        }]
    }, {
        id: 3.3,
        type: 1,
        name: '3.3 设置题型“多选题”',
        pats: [{
            pat: /^ *[一二三四五六七八九十]{1}(、|\.)(多项选择题|多选题){1}$/,
            rep: '题型：多选题'
        }]
    }, {
        id: 3.4,
        type: 1,
        name: '3.4 设置题型“判断题”',
        pats: [{
            pat: /^ *[一二三四五六七八九十]{1}(、|\.)(判断改错题|判断辨析题|判断题|辨析题){1}.*?$/,
            rep: '题型：判断题'
        }]
    }, {
        id: 3.5,
        type: 2,
        name: '3.5 设置题型“实务题”',
        pats: [{
            pat: /^ *[一二三四五六七八九十]{1}(、|\.)(实务题){1}.*?$/,
            rep: '题型：实务题'
        }]
    },
    /*----------------------------------------------------------------------------------------------------*/

    // 4. 后置处理
    {
        id: 4.1,
        type: 1,
        name: '4.1 去除“解析”、“依据”、“解释”文本',
        pats: [{
            pre: [{
                pat: /(<r><n>)([0-9A-Z]+)(?![0-9A-Z]+)(?!\.)/,
                rep: '$1'
            }],
            //pat: /(\n)(([^0-9A-Z<>\/分题]+)|([0-9]+×+)).+?(\n)/,
            pat: 
                '(<r><n>)'+ 
                '(' + 
                    '(?![0-9A-Z</分题]+)' + 
                    //'|([0-9]+×+)' + 
                ')' + 
                '(.+?)' + 
                '(?=<r><n>)',
            rep: '$1',
            time: 0
        }]
    }
]
